app/controllers/api/v1/popular_products_controller.rb

	def index
		@populars = ProductInvest.all.order("count_view DESC")
		if @populars.present?
---
SELECT "product_invests".* FROM "product_invests" ORDER BY "product_invests"."count_view" DESC, count_view DESC