app/controllers/api/v1/product_invests_controller.rb

def index
	prodinvests = ProductInvest.all
	if prodinvests.present?
---
SELECT "product_invests".* FROM "product_invests"

def create
	prodinvest = ProductInvest.new(prodinvest_params)
	if prodinvest.save
---
INSERT INTO "product_invests" ("price", "slot", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["price", 40000000.0], ["slot", 15], ["created_at", "2018-12-02 11:05:14.529645"], ["updated_at", "2018-12-02 11:05:14.529645"]]

	def update
		update_prodinvest = ProductInvest.update(prodinvest_params)
---
UPDATE "product_invests" SET "price" = $1, "slot" = $2, "updated_at" = $3 WHERE "product_invests"."id" = $4  [["price", 2000.0], ["slot", 20], ["updated_at", "2018-12-02 11:00:21.936770"], ["id", 1]]

	def find_prodinvest
		@prodinvest = ProductInvest.find_by(id: params[:id])
---
SELECT  "product_invests".* FROM "product_invests" WHERE "product_invests"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]